{
  "id": "core-module",
  "title": "Agent Core",
  "description": "Module documentation for the Agent Core, covering discovery, execution, error handling, and more.",
  "content_markdown": "# Agent Core Module Reference\n\n## Overview\nThe Agent Core module manages the functionalities for agents, facilitating project analysis and execution of tools dynamically.\n\n## File Analysis\n\n### File: app/agents/discovery_pipeline.py\n- **Pipeline Execution**: Implements project discovery pipeline stages with a dynamic order defined by `active_stages`, allowing for customization of the analysis flow.\n- **Tech Stack Analysis**: Utilizes the `TechnologyScanner` to analyze the project’s repository, gathering relevant technology data to enhance efficiency.\n- **Prompt Management**: Maps analysis stages to specific prompt files through `_get_prompt_for_stage`, ensuring correct prompts are used in each stage.\n\n### File: app/agents/agent_executor.py\n- **Tool Execution**: Facilitates dynamic tool execution through `AgentExecutor`, allowing tools to be registered and invoked at runtime.\n- **Message Handling**: Manages conversation history with message tracking to maintain context during agent interactions.\n- **Error Handling**: Incorporates structured error handling for tool execution, including logging to aid in debugging.\n\n### File: app/core/logger.py\n- **Logging**: Configures a logger for both file and console output, writing logs to a rotating file based on `settings.log_dir` and logging level.\n\n### File: app/core/database.py\n- **Database Access**: Sets up an asynchronous SQLite connection with `SQLModel`, allowing for non-blocking database access through async sessions.\n\n### File: app/core/config.py\n- **Configuration**: Defines app configurations with Pydantic's `BaseSettings`, enabling environment variable loading and facilitating external configurations.\n\n### File: app/agents/tools/registry.py\n- **Tool Management**: Implements `ToolRegistry` to manage tool definitions and JSON schema generation for calling functions, ensuring type safety.\n- **Schema Generation**: Uses Pydantic's `create_model` for dynamic model creation to enable serialization and validation of parameters.\n- **Singleton Pattern**: Constructs a singleton instance of `ToolRegistry` for global access.\n\n### File: app/agents/tools/project_tools.py\n- **Project Management**: Defines async functions for managing project lifecycles using `ProjectService`, interacting with the database.\n- **Database Interaction**: Utilizes `AsyncSessionLocal` for proper session management during database operations.\n\n### File: app/agents/tools/file_tools.py\n- **File Management**: Implements asynchronous functions for file registration, reading content, and directory listing, utilizing `FileService`.\n- **Security Checks**: Enforces security measures for accessed paths to prevent unauthorized access outside intended directories.\n\n### File: app/agents/core/types.py\n- **Type Definition**: Defines the `AnalysisStage` type alias to constrain allowed values, enhancing code readability and maintainability.\n\n### File: app/agents/miner/agent.py\n- **Agent Functionality**: Implements the `MinerAgent` class for analyzing files and extracting structured conclusions systematically.\n- **Asynchronous Execution**: Features async methods for file analysis, optimizing performance via non-blocking execution.\n- **Error Handling**: Incorporates error handling and fallback logic for robust analysis methods.\n\n### File: app/agents/miner/schema.py\n- **Data Modeling**: Defines structured data models with Pydantic for strict validation and clarity in analysis results.\n\n## Dependencies\n- **app/agents/tools**: Communicates with various tools for project and file management, integrating analytics and execution operations.\n- **app/core**: Relies on configurations, logging, and database management essentials for proper function execution.\n\n- When errors occur, the respective modules handle and log errors, promoting transparency in the system's operations.\n\n---",
  "diagram_mermaid": null,
  "related_files": []
}