{
  "id": "data-models-overview",
  "title": "Architecture Overview",
  "description": "Overview of the architecture for the scanning subsystem, detailing key components and how they interact.",
  "content_markdown": "# Architecture Overview\n\n## Introduction\nThe Architecture Overview provides insight into the scanning subsystem, responsible for identifying and managing various technology-specific metadata, relationships, and file structures within software repositories. This subsystem operates as part of a broader technology scanning platform that integrates multiple programming languages and technologies, facilitating effective dependency management and configuration recognition.\n\n## Key Concepts\n### Modular File Scanning\nThe subsystem employs a modular design that categorizes scanning functions based on technology types. Each scanner focuses on identifying and aggregating relevant metadata from specific programming languages, frameworks, and environments.  \n\n### Use of SQLModel\nThe data models are primarily defined using SQLModel, allowing for type-safe interactions with relational databases. This aids in maintaining relationships between different entities, such as projects, files, and configurations.  \n\n### Relationship Management\nKey data entities such as `File`, `Project`, `TreeNode`, and `Fact` are interconnected through foreign key relationships, ensuring referential integrity across the database. This structure empowers the application to efficiently retrieve and manage related data in a coherent manner.\n\n### Configuration Recognition\nThe subsystem is equipped with functionality to recognize configuration standards for various frameworks, utilizing predefined dictionaries for dependencies and configurations that streamline the scanning process.\n\n## Diagrams\n```mermaid\ngraph TD;\n    A[Scanner Module] -->|Detects| B[JavaScript Frameworks]\n    A -->|Detects| C[Python Frameworks]\n    A -->|Detects| D[Database Configs]\n    B -->|Uses| E[Framework Dependencies]\n    B -->|Recognizes| F[Configuration Standards]\n    C -->|Uses| G[Framework Configs]\n    C -->|Recognizes| H[Package Managers]\n    D -->|Identifies| I[DB File Patterns]\n    I -->|Reads| J[Project Model]\n    J -->|Associations| K[File, Fact, Relation, TreeNode]\n```  \n\n## Tech Stack\nThe subsystem employs a diverse set of libraries and technologies:  \n- **SQLModel**: For handling ORM-based database interactions.\n- **Docker**: For containerizing the application and microservices architecture.\n- **JavaScript/TypeScript frameworks**: Metadata handling for frameworks such as React, Angular, etc.\n- **Python frameworks**: Metadata management for frameworks like Django and Flask.\n- **Database Configuration Standards**: To facilitate database recognition and management.\n\nThis architecture serves as a robust framework for integrating scanning capabilities into a comprehensive technology management solution, ensuring developers can leverage technology metadata effectively.",
  "diagram_mermaid": "graph TD;\n    A[Scanner Module] -->|Detects| B[JavaScript Frameworks]\n    A -->|Detects| C[Python Frameworks]\n    A -->|Detects| D[Database Configs]\n    B -->|Uses| E[Framework Dependencies]\n    B -->|Recognizes| F[Configuration Standards]\n    C -->|Uses| G[Framework Configs]\n    C -->|Recognizes| H[Package Managers]\n    D -->|Identifies| I[DB File Patterns]\n    I -->|Reads| J[Project Model]\n    J -->|Associations| K[File, Fact, Relation, TreeNode]\n",
  "related_files": []
}