{
  "id": "scanners-module",
  "title": "Scanners",
  "description": "Comprehensive documentation for the Scanners module, detailing functionality and file structure.",
  "content_markdown": "# Scanners Module Documentation\n\n## Overview\nThe Scanners module provides functionality to analyze and identify technology stacks in a repository by scanning for language-specific files and frameworks.\n\n## Files Analysis\n\n### File: scan_readme.py\n- **Functionality**: Implements the `scan_readme` function, which recursively searches for README files across a specified directory path using the `Path.rglob` method.\n- **Error Handling**: Utilizes a try-except block to handle reading errors, ensuring the function skips problematic files without failing entirely.\n- **Data Structuring**: Creates a list of dictionaries to systematically store metadata (path, filename, size, first line) for each found README file.\n- **Output Format**: Returns a dictionary with a `has_readme` flag and a `readmes` key for the collected metadata.\n\n### File: technology_scanner.py\n- **Architecture**: Defines the `TechnologyScanner` class to coordinate different specialized scanners (e.g., Python, JavaScript) for comprehensive technology detection.\n- **Error Handling**: Includes try-except blocks to ensure that errors in individual scanners do not halt the entire scanning process.\n- **Logging**: Incorporates logging to track scan progress and results, aiding debugging and monitoring.\n- **Output Structure**: Returns a list of dictionaries detailing the results of each technology scan, including ecosystem-specific details.\n- **Output Formatting**: Provides a `format_for_llm` method to convert scan results into a structured string, simplifying AI analysis.\n\n### File: python.py\n- **Functionality**: Implements the `PythonScanner` class, which scans for .py and .ipynb files, as well as frameworks from `requirements.txt` and `pyproject.toml`.\n- **Dependency Management**: Facilitates parsing of dependency files to accurately identify frameworks and manages version specifications.\n- **File Iteration**: Uses `_iter_repo_files` to exclude common irrelevant directories during the repository scan.\n- **Data Return Structure**: Returns a structured dictionary summarizing detected Python files, frameworks, and package managers.\n- **Error Handling**: Includes error handling to ensure robust file scanning, even when some files are unreadable.\n\n### File: javascript.py\n- **Functionality**: Defines the `JavaScriptScanner` class that identifies JS and TS files and collects dependencies from `package.json`.\n- **Dependency Management**: Extracts framework information from both dependencies and devDependencies in `package.json`.\n- **File Iteration**: Implements `_iter_repo_files` to avoid scanning 'node_modules', focusing on relevant project files.\n- **Data Return Structure**: Returns a structured dictionary summarizing detected JavaScript and TypeScript files and their frameworks.\n- **Error Handling**: Features error handling when reading `package.json` to safely manage malformed data issues.\n\n### File: docker.py\n- **Functionality**: Implements the `DockerScanner` class for scanning Docker-related configuration files including Dockerfiles.\n- **File Iteration**: Employs `_iter_repo_files` to ensure thorough traversal for all Docker configuration files.\n- **Dockerfile Detection**: Uses `_is_dockerfile` to validate Dockerfile names and patterns.\n- **Data Return Structure**: Returns a dictionary summarizing counts and paths of detected Docker-related files.\n- **Logging**: Utilizes logging for completion tracking and debugging during the Docker scan.\n\n### File: database.py\n- **File Scanning**: Contains logic to identify database-related files through `_iter_repo_files`, omitting ignored directories.\n- **Database Detection**: Categorizes database files using predefined extension sets from the `metadata.database_config` module.\n- **Directory Detection**: Identifies database directories that suggest active database structures.\n- **Logging**: Implements logging to capture activity and provide insights during scanning processes.\n\n### File: base.py\n- **Abstract Class Design**: Establishes the `TecnologyScanner` abstract base class, mandating implementation of the `scan` method across subclasses.\n- **Initialization Parameters**: Initializes with a `repo_path`, accessible to derived scanner classes.\n\n### File: docker_config.py\n- **Docker Configuration Patterns**: Defines patterns for identifying Docker configuration files, enhancing scanning capabilities across technology stacks.\n\n### File: javascript_frameworks.py\n- **JavaScript Frameworks Metadata**: Provides metadata for JavaScript frameworks, useful for detecting technologies in scanned repositories.\n- **Framework Configuration Standards**: Lists configuration filenames necessary for recognizing framework-specific setups.\n- **Package Manager Identifiers**: Defines identifiers for package managers to streamline the scanning of JavaScript projects.\n\n### File: database_config.py\n- **Database File Patterns**: Specifies patterns for identifying database files and configurations, crucial for the `DatabaseScanner` class.\n- **Configuration Files**: Lists various configuration file names vital for recognizing database ORM configurations.\n- **Database-related Directories**: Lists known directory names that indicate database usage, aiding the scanning process.\n\n### File: python_frameworks.py\n- **Framework Dependencies**: Maps popular Python frameworks to their packages for better dependency management.\n- **Framework Configurations**: Links frameworks to their essential configuration files for easy access.\n- **Package Management**: Associates common Python package managers with configuration file identifiers, facilitating package handling.\n\n## Dependencies\n- The `scanners` module interacts with various parts of the `app/scanners/technologies` submodule to handle specific language scanning logic and framework identification.\n- It utilizes utilities from `app.core.logger` for logging purposes, and files from `app.scanners.technologies.metadata` for configuration and metadata handling across various scanning processes.",
  "diagram_mermaid": null,
  "related_files": [
    "scan_readme.py",
    "technology_scanner.py",
    "python.py",
    "javascript.py",
    "docker.py",
    "database.py",
    "base.py",
    "docker_config.py",
    "javascript_frameworks.py",
    "database_config.py",
    "python_frameworks.py"
  ]
}