{
  "id": "technologies-module",
  "title": "Technologies Module Reference",
  "description": "Comprehensive documentation of the Technologies scanning module for various programming languages.",
  "content_markdown": "# Overview\nThis module provides functionality to scan repositories for various technologies, including Python, JavaScript, Docker configurations, and databases.\n\n## File: base.py\n- **Purpose**: Defines an abstract base class for technology scanners, enforcing a consistent scanning interface.\n- **Key Classes/Functions**:\n  - `TecnologyScanner` (abstract class): Enforces subclasses to implement the `scan` method and initializes with the repository path.\n\n## File: python.py\n- **Purpose**: Scans repositories for Python technologies including frameworks and package managers.\n- **Key Classes/Functions**:\n  - `PythonScanner`\n    - Scans for Python files (`.py`), Jupyter notebooks (`.ipynb`), and frameworks from configuration files.\n    - Manages dependencies by parsing `requirements.txt` and `pyproject.toml` for frameworks.\n    - Iterates through repository files while excluding irrelevant directories.\n    - Returns structured data on detected files and frameworks, handles errors gracefully.\n\n## File: javascript.py\n- **Purpose**: Scans repositories for JavaScript and TypeScript technologies.\n- **Key Classes/Functions**:\n  - `JavaScriptScanner`\n    - Scans for JavaScript files and frameworks from `package.json`.\n    - Identifies dependencies and devDependencies for accurate framework analysis.\n    - Excludes 'node_modules' during file iteration to maintain relevance.\n    - Returns structured summary of findings, ensuring robustness against file reading errors.\n\n## File: docker.py\n- **Purpose**: Scans for Docker configuration files in repositories.\n- **Key Classes/Functions**:\n  - `DockerScanner`\n    - Identifies Dockerfiles, Docker Compose files, and Ignore files.\n    - Utilizes naming conventions to validate Dockerfile formats.\n    - Implements a thorough file iteration process to ensure all relevant configurations are found.\n    - Logs results and debugging information for better visibility.\n\n## File: database.py\n- **Purpose**: Scans for database-related files within repositories.\n- **Key Classes/Functions**:\n  - `DatabaseScanner`\n    - Detects database files based on extensions and directory structures.\n    - Uses constant definitions for extension criteria to categorize databases correctly.\n    - Logs the scanning process for easy traceability.\n\n## File: metadata/docker_config.py\n- **Purpose**: Provides patterns for recognizing Docker configuration files.\n\n## File: metadata/javascript_frameworks.py\n- **Purpose**: Contains metadata for recognizing JavaScript frameworks and their dependencies.\n\n## File: metadata/database_config.py\n- **Purpose**: Defines patterns for identifying various database file types and configurations.\n\n## File: metadata/python_frameworks.py\n- **Purpose**: Encapsulates details regarding Python frameworks and their respective configuration and package management needs.\n\n## Dependencies\n- This module interacts with various files in `app/scanners/technologies/metadata`, including frameworks and database files patterns, establishing a robust scanning environment for multiple technology types.",
  "diagram_mermaid": null,
  "related_files": [
    "app/scanners/technologies/base.py",
    "app/scanners/technologies/python.py",
    "app/scanners/technologies/javascript.py",
    "app/scanners/technologies/docker.py",
    "app/scanners/technologies/database.py",
    "app/scanners/technologies/metadata/docker_config.py",
    "app/scanners/technologies/metadata/javascript_frameworks.py",
    "app/scanners/technologies/metadata/database_config.py",
    "app/scanners/technologies/metadata/python_frameworks.py"
  ]
}